{
  "x_boundary_condition": {
    "default_value": "open",
    "description": "1. open - exiting radiance is lost. 2. periodic - exiting radiance returns from the opposite side."
  },
  "y_boundary_condition": {
    "default_value": "open",
    "description": "1. open - exiting radiance is lost. 2. periodic - exiting radiance returns from the opposite side."
  },
  "num_mu_bins": {
    "default_value": 16,
    "description": "(NMU) number of discrete ordinates covering -1 < mu < 1."
  },
  "num_phi_bins": {
    "default_value": 32,
    "description": "(NPHI) number of discrete ordinates covering 0 < phi < 2pi"
  },
  "split_accuracy": {
    "default_value": 0.03,
    "description": [
      "(SPLITACC) cell splitting accuracy; grid cells that have the adaptive splitting criterion above this value are split.",
      "This is an absolute measure, but cannot be easily associated with the resulting radiometric accuracy. Set to zero or negative for no adaptive cell splitting."
    ]
  },
  "deltam": {
    "default_value": true,
    "description": "(DELTAM) True for delta-M scaling of medium and Nakajima and Tanaka method of computing radiances."
  },
  "spherical_harmonics_accuracy": {
    "default_value": 0.0,
    "description": [
      "(SHACC) adaptive spherical harmonic truncation accuracy; the spherical harmonic source function series is truncated after the terms are below this level.",
      "Truncation can still happens if SHACC=0 (for 0 source terms).This is also an absolute measure, and is approximately the level of accuracy."
    ]
  },
  "acceleration_flag": {
    "default_value": true,
    "description": "(ACCELFLAG) True to do the sequence acceleration. An acceleration extrapolation of the source function is done every other iteration."
  },
  "solution_accuracy": {
    "default_value": 0.0001,
    "description": "(SOLACC) solution accuracy - tolerance for solution criterion."
  },
  "max_total_mb": {
    "default_value": 3000.0,
    "description": "approximate maximum memory to use (MB for 4 byte reals)"
  },
  "adapt_grid_factor": {
    "default_value": 5,
    "description": "(ADAPT_GRID_FACTOR) ratio of total grid points to base grid points"
  },
  "num_sh_term_factor": {
    "default_value": 1,
    "description": "(NUM_SH_TERM_FACTOR) ratio of average number of spherical harmonic terms to total possible (NLM)"
  },
  "cell_to_point_ratio": {
    "default_value": 1.5,
    "description": "(CELL_TO_POINT_RATIO) ratio of number of grid cells to grid points"
  },
  "high_order_radiance": {
    "default_value": false,
    "description": "True to keep the high order radiance field in memory for diagnostic purposes."
  },
  "ip_flag": {
    "default_value": 0,
    "description": [
      "(IPFLAG) Bit flags for independent pixel mode: 0 for 3D, 1 for independent (2D) scans in X, 2 for 2D scans in Y (X-Z planes)",
      "3 for indepedent pixels (i.e. bit 0 for X and bit 1 for Y). Bit 2 of IPFLAG means do the direct beam in 3D,",
      " e.g. IPFLAG=7 means 3D direct beam but IP diffuse radiative transfer."
    ]
  },
  "iterfixsh": {
    "default_value": 30,
    "description": "The number of iterations after which the spherical harmonic truncation is fixed."
  },
  "tautol": {
    "default_value": 0.1,
    "description": "The maximum optical length of each subgrid interval for integration of radiances. Only affects radiance accuracy."
  },
  "angle_set": {
    "default_value": 2,
    "description": "The angle set used for the discrete ordinates. Gaussian: 1, Reduced Gaussian: 2, Reduced Double Gaussian: 3."
  },
  "transcut": {
    "default_value": 1e-05,
    "description": "The minimum transmission to integrate to when calculating radiances."
  },
  "transmin": {
    "default_value": 1.0,
    "description": "The minimum transmission to integrate in the short characteristics scheme. Values less than 1.0 turn 1-cell characteristics into potentially long characteristics."
  }
}